Autodesk.Revit.DB.LeaderShape
Since:
2016
Supported geometric shapes of annotation leaders.
Remarks:
Although the Autodesk.Revit.DB.Leader class supports
all available shapes, not all types of leaders may have the option to
change its shape. For example, leaders of text annotations can be of
any shape, while leaders of level lines are never curved.
Since:
2016

Autodesk.Revit.DB.LeaderShape.Arc
An arc between between the end point and anchor point.
In this shape the elbow point controls the arc's radius.

Autodesk.Revit.DB.LeaderShape.Kinked
A kinked line with a shoulder defined by an elbow point.

Autodesk.Revit.DB.LeaderShape.Straight
A single straight line between the end point and anchor point.